EX08: PROC OPTIONS (MAIN);
	DCL A BIN FIXED INIT ( 33 );
	DCL B DEC FIXED INIT ( 33 );
	DCL C BIN FIXED INIT ( 3 );
	DCL D BIN FIXED (31);
	D = A + B - B;
	
END EX08;