EXAMP: PROC OPTIONS (MAIN);
DCL E M;
DCL A BIN FIXED (31) INIT ( 111B );
DCL B BIN FIXED () INIT ( 100B );
DCL C BIN FIXED (31) INIT ( 101B );
DCL D BIN FIXED (31);
D = A + B - B;
END EXAMP;