#define DL_ASSTEXT 30
#define DL_OBJTEXT 100                            /*äëèíà îá'åêòí. òåêñòà   */
#define NSYM 30                                   /*ðàçìåð òàáë.ñèìâîëîâ    */
#define NPOP 6                                    /*ðàçìåð òàáë.ïñåâäîîïåð. */
#define NOP  12                                   /*ðàçìåð òàáë.îïåðàöèé    */
#include <string.h>                               /*âêë.ñòðîêîâûå ïîäïðîãð. */
#include <stdlib.h>                               /*âêë.ïîäïðîãð.ïðåîáð.äàíí*/
#include <stdio.h>                                /*âêë.ïîäïð.ñòàíä.ââ/âûâ  */
#include <ctype.h>                                /*âêë.ïîäïð.êëàññèô.ñèìâ. */
#include <unistd.h>

/*
 ******* Á Ë Î Ê  îá'ÿâëåíèé ñòàòè÷åñêèõ ðàáî÷èõ ïåðåìåííûõ
 */

char NFIL [30] = "\x0";

unsigned char PRNMET = 'N';                       /*èíäèêàòîð îáíàðóæ.ìåòêè */
int I3; /*ñ÷åò÷èê öèêëà           */
unsigned char PL3_buf[3];
unsigned char PL8_buf[8];                         /*áóôåð äëÿ ïåðåäà÷è PL8  */

void print_pl_value (unsigned char* buf, size_t len)
{
    for ( size_t i = 0; i < len; ++i )
    {
        printf ("[%0X %0X]", (buf[i] & 0xF0) >> 4,
                (buf[i] & 0x0F));
    }
    printf ("\n");
}

/*
 ***** Á Ë Î Ê  îá'ÿâëåíèé ïðîòîòèïîâ îáðàùåíèé ê ïîäïðîãðàììàì 1-ãî ïðîñìîòðà
 */

/*ï ð î ò î ò è ï  îáðàù.ê*/
int FDC();                                        /*ïîäïð.îáð.ïñ.îïåð.DC    */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int FDS();                                        /*ïîäïð.îáð.ïñ.îïåð.DS    */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int FEND();                                       /*ïîäïð.îáð.ïñ.îïåð.END   */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int FEQU();                                       /*ïîäïð.îáð.ïñ.îïåð.EQU   */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int FSTART();                                     /*ïîäïð.îáð.ïñ.îïåð.START */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int FUSING();                                     /*ïîäïð.îáð.ïñ.îïåð.USING */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int FRR();                                        /*ïîäïð.îáð.îïåð.RR-ôîðì. */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int FRX();                                        /*ïîäïð.îáð.îïåð.RX-ôîðì. */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int FSS();                                        /*ïîäïð.îáð.îïåð.SS-ôîðì. */
/*..........................................................................*/


/*
 ***** Á Ë Î Ê  îá'ÿâëåíèé ïðîòîòèïîâ îáðàùåíèé ê ïîäïðîãðàììàì 2-ãî ïðîñìîòðà
 */

/*ï ð î ò î ò è ï  îáðàù.ê*/
int SDC();                                        /*ïîäïð.îáð.ïñ.îïåð.DC    */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int SDS();                                        /*ïîäïð.îáð.ïñ.îïåð.DS    */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int SEND();                                       /*ïîäïð.îáð.ïñ.îïåð.END   */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int SEQU();                                       /*ïîäïð.îáð.ïñ.îïåð.EQU   */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int SSTART();                                     /*ïîäïð.îáð.ïñ.îïåð.START */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int SUSING();                                     /*ïîäïð.îáð.ïñ.îïåð.USING */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int SRR();                                        /*ïîäïð.îáð.îïåð.RR-ôîðì. */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int SRX();                                        /*ïîäïð.îáð.îïåð.RX-ôîðì. */
/*..........................................................................*/
/*ï ð î ò î ò è ï  îáðàù.ê*/
int SSS();                                        /*ïîäïð.îáð.îïåð.SS-ôîðì. */
/*..........................................................................*/

/*
 ******* Á Ë Î Ê  îá'ÿâëåíèé òàáëèö áàçû äàííûõ êîìïèëÿòîðà
 */

/*
 ******* ÎÁ'ßÂËÅÍÈÅ ñòðóêòóðû ñòðîêè (êàðòû) èñõîäíîãî òåêñòà
 */

struct ASSKARTA                                  /*ñòðóêò.êàðòû ÀÑÑÅÌÁËÅÐÀ */
{
    unsigned  char METKA    [ 8];                  /*ïîëå ìåòêè              */
    unsigned  char PROBEL1  [ 1];                  /*ïðîáåë-ðàçäåëèòåëü      */
    unsigned  char OPERAC   [ 5];                  /*ïîëå îïåðàöèè           */
    unsigned  char PROBEL2  [ 1];                  /*ïðîáåë-ðàçäåëèòåëü      */
    unsigned  char OPERAND  [12];                  /*ïîëå îïåðàíäà           */
    unsigned  char PROBEL3  [ 1];                  /*ïðîáåë ðàçäåëèòåëü      */
    unsigned  char COMM     [52];                  /*ïîëå êîììåíòàðèÿ        */
};

/*
 ******* ÍÀËÎÆÅÍÈÅ ñòðóêòóðû êàðòû èñõ. òåêñòà íà âõîäíîé áóôåð
 */

union                                            /*îïðåäåëèòü îá'åäèíåíèå  */
{
    unsigned char BUFCARD [80];                    /*áóôåð êàðòû.èñõ.òåêñòà  */
    struct ASSKARTA STRUCT_BUFCARD;                /*íàëîæåíèå øàáë.íà áóôåð */
} TEK_ISX_KARTA;

/*
 ***** Ñ×ÅÒ×ÈÊ îòíîñèòåëüíîãî àäðåñà (ñìåùåøèÿ îòíîñèòåëüíî áàçû )
 */

int CHADR;                                       /*ñ÷åò÷èê                 */

/*
 ***** ÒÀÁËÈÖÀ ñèìâîëîâ
 */

int ITSYM = -1;                                  /*èíä.ñâîá.ñòð. òàáë.ñèìâ.*/
struct TSYM                                      /*ñòðóêò.ñòðîêè òàáë.ñèìâ.*/
{
    unsigned char IMSYM [8];                       /*èìÿ ñèìâîëà             */
    int           ZNSYM;                           /*çíà÷åíèå ñèìâîëà        */
    int           DLSYM;                           /*äëèíà ñèìâîëà           */
    char          PRPER;                           /*ïðèçíàê ïåðåìåùåíèÿ     */
};

struct TSYM T_SYM [NSYM];                        /*îïðåäåëåíèå òàáë.ñèìâ.  */

/*
 ***** ÒÀÁËÈÖÀ ìàøèííûõ îïåðàöèé
 */

struct TMOP                                      /*ñòðóêò.ñòð.òàáë.ìàø.îïåð*/
{
    unsigned char MNCOP [5];                       /*ìíåìîêîä îïåðàöèè       */
    unsigned char CODOP    ;                       /*ìàøèííûé êîä îïåðàöèè   */
    unsigned char DLOP     ;                       /*äëèíà îïåðàöèè â áàéòàõ */
    int (*BXPROG)()        ;                       /*óêàçàòåëü íà ïîäïð.îáðàá*/
} T_MOP [NOP]  =                                /*îá'ÿâëåíèå òàáë.ìàø.îïåð*/
{
    {{'B','A','L','R',' '} , '\x05' , 2 , FRR} , /*èíèöèàëèçàöèÿ           */
    {{'B','C','R',' ',' '} , '\x07' , 2 , FRR} , /*ñòðîê                   */
    {{'C','R',' ',' ',' '} , '\x19' , 2 , FRR} , /*                        */
    {{'S','T',' ',' ',' '} , '\x50' , 4 , FRX} , /*òàáëèöû                 */
    {{'L',' ',' ',' ',' '} , '\x58' , 4 , FRX} , /*ìàøèííûõ                */
    {{'A',' ',' ',' ',' '} , '\x5A' , 4 , FRX} , /*îïåðàöèé                */
    {{'S',' ',' ',' ',' '} , '\x5B' , 4 , FRX} , /*                        */
    {{'C','V','B',' ',' '} , '\x4F' , 4 , FRX} , /*                        */
    {{'L','H',' ',' ',' '} , '\x48' , 4 , FRX} , /*                        */
    {{'B','C',' ',' ',' '} , '\x47' , 4 , FRX} , /*                        */
    {{'S','T','H',' ',' '} , '\x40' , 4 , FRX} , /*                        */
    {{'M','V','C',' ',' '} , '\xD2' , 6 , FSS} , /*                        */
};

/*
 ***** ÒÀÁËÈÖÀ ïñåâäîîïåðàöèé
 */

struct TPOP                                      /*ñòðóêò.ñòð.òàáë.ïñ.îïeð.*/
{
    unsigned char MNCPOP[5];                       /*ìíåìîêîä ïñåâäîîïåðàöèè */
    int (*BXPROG) ()       ;                       /*óêàçàòåëü íà ïîäïð.îáðàá*/
} T_POP [NPOP] =                                /*îá'ÿâëåíèå òàáë.ïñåâäîîï*/
{
    {{'D','C',' ',' ',' '} , FDC   },            /*èíèöèàëèçàöèÿ           */
    {{'D','S',' ',' ',' '} , FDS   },            /*ñòðîê                   */
    {{'E','N','D',' ',' '} , FEND  },            /*òàáëèöû                 */
    {{'E','Q','U',' ',' '} , FEQU  },            /*ïñåâäîîïåðàöèé          */
    {{'S','T','A','R','T'} , FSTART},            /*                        */
    {{'U','S','I','N','G'} , FUSING}             /*                        */
};

/*
 ***** ÒÀÁËÈÖÀ áàçîâûõ ðåãèñòðîâ
 */

struct TBASR                                     /*ñòðóêò.ñòð.òàáë.áàç.ðåã.*/
{
    int SMESH;                                     /*                        */
    char PRDOST;                                   /*                        */
} T_BASR[15] =                                  /*                        */
{
    {0x00,'N'},                                  /*èíèöèàëèçàöèÿ           */
    {0x00,'N'},                                  /*ñòðîê                   */
    {0x00,'N'},                                  /*òàáëèöû                 */
    {0x00,'N'},                                  /*áàçîâûõ                 */
    {0x00,'N'},                                  /*ðåãèñòðîâ               */
    {0x00,'N'},                                  /*                        */
    {0x00,'N'},                                  /*                        */
    {0x00,'N'},                                  /*                        */
    {0x00,'N'},                                  /*                        */
    {0x00,'N'},                                  /*                        */
    {0x00,'N'},                                  /*                        */
    {0x00,'N'},                                  /*                        */
    {0x00,'N'},                                  /*                        */
    {0x00,'N'},                                  /*                        */
    {0x00,'N'}                                   /*                        */
};

/*
 ***** Á Ë Î Ê   îá'ÿâëåíèÿ ìàññèâà ñ îá'åêòíûì òåêñòîì
 */

unsigned char OBJTEXT [DL_OBJTEXT][80];         /*ìàññèâ îá'åêòíûõ êàðò   */
int ITCARD = 0;                                 /*óêàçàòåëü òåêóù.êàðòû   */

struct OPRR                                     /*ñòðóêò.áóô.îïåð.ôîðì.RR */
{
    unsigned char OP;                             /*êîä îïåðàöèè            */
    unsigned char R1R2;                           /*R1 - ïåðâûé îïåðàíä     */
    /*R2 - âòîðîé îïåðàíä     */
};

union                                           /*îïðåäåëèòü îá'åäèíåíèå  */
{
    unsigned char BUF_OP_RR [2];                  /*îïðåäåëèòü áóôåð         */
    struct OPRR OP_RR;                            /*ñòðóêòóðèðîâàòü åãî     */
    int RR;
} RR;

struct OPRX                                     /*ñòðóêò.áóô.îïåð.ôîðì.RX */
{
    unsigned char OP;                             /*êîä îïåðàöèè            */
    unsigned char R1X2;                           /*R1 - ïåðâûé îïåðàíä     */
    short B2D2;                                   /*X2 - âòîðîé îïåðàíä     */
    /*B2 - áàç.ðåã.2-ãî îï-äà */
    /*D2 - ñìåùåí.îòíîñèò.áàçû*/
};

union                                           /*îïðåäåëèòü îá'åäèíåíèå  */
{
    unsigned char BUF_OP_RX [4];                  /*îðåäåëèòü áóôåð         */
    struct OPRX OP_RX;                            /*ñòðóêòóðèðîâàòü åãî     */
    unsigned long RX;
} RX;

struct OPSS                                     /*ñòðóêò.áóô.îïåð.ôîðì.SS */
{
    unsigned char OP;                             /*êîä îïåðàöèè            */
    unsigned char L1L2;                           /*L1 è L2                 */
    short B1D1;                                   /*B1 è D1                 */
    short B2D2;                                   /*B2 è D2                 */
};

union                                           /*îïðåäåëèòü îá'åäèíåíèå  */
{
    unsigned char BUF_OP_SS [6];                  /*îðåäåëèòü áóôåð         */
    struct OPSS OP_SS;                            /*ñòðóêòóðèðîâàòü åãî     */
} SS;

struct STR_BUF_ESD                              /*ñòðóêò.áóôåðà êàðòû ESD */
{
    unsigned char POLE1      ;                    /*ìåñòî äëÿ êîäà 0x02     */
    unsigned char POLE2  [ 3];                    /*ïîëå òèïà îá'åêòí.êàðòû */
    unsigned char POLE3  [ 6];                    /*ïðîáåëû                 */
    unsigned char POLE31 [ 2];                    /*äëèíà äàííûõ íà êàðòå   */
    unsigned char POLE32 [ 2];                    /*ïðîáåëû                 */
    unsigned char POLE4  [ 2];                    /*âíóòð.èä-ð èìåíè ïðîãð. */
    unsigned char IMPR   [ 8];                    /*èìÿ ïðîãðàììû           */
    unsigned char POLE6      ;                    /*êîä òèïà ESD-èìåíè      */
    unsigned char ADPRG  [ 3];                    /*îòíîñèò.àäðåñ ïðîãðàììû */
    unsigned char POLE8      ;                    /*ïðîáåëû                 */
    unsigned char DLPRG  [ 3];                    /*äëèíà ïðîãðàììû         */
    unsigned char POLE10 [40];                    /*ïðîáåëû                 */
    unsigned char POLE11 [ 8];                    /*èäåíòèôèêàöèîííîå ïîëå  */
};

struct STR_BUF_TXT                               /*ñòðóêò.áóôåðà êàðòû TXT */
{
    unsigned char POLE1      ;                    /*ìåñòî äëÿ êîäà 0x02     */
    unsigned char POLE2  [ 3];                    /*ïîëå òèïà îá'åêòí.êàðòû */
    unsigned char POLE3      ;                    /*ïðîáåë                  */
    unsigned char ADOP   [ 3];                    /*îòíîñèò.àäðåñ îïðåàöèè  */
    unsigned char POLE5  [ 2];                    /*ïðîáåëû                 */
    unsigned char DLNOP  [ 2];                    /*äëèíà îïåðàöèè          */
    unsigned char POLE7  [ 2];                    /*ïðîáåëû                 */
    unsigned char POLE71 [ 2];                    /*âíóòðåííèé èäåíò.ïðîãð. */
    unsigned char OPER   [56];                    /*òåëî îïåðàöèè           */
    unsigned char POLE9  [ 8];                    /*èäåíòèôèêàöèîííîå ïîëå  */
};

struct STR_BUF_END                                /*ñòðóêò.áóôåðà êàðòû END */
{
    unsigned char POLE1      ;                    /*ìåñòî äëÿ êîäà 0x02     */
    unsigned char POLE2  [ 3];                    /*ïîëå òèïà îá'åêòí.êàðòû */
    unsigned char POLE3  [68];                    /*ïðîáåëû                 */
    unsigned char POLE9  [ 8];                    /*èäåíòèôèêàöèîííîå ïîëå  */
};

union                                           /*îïðåäåëèòü îá'åäèíåíèå  */
{
    struct STR_BUF_ESD STR_ESD;                   /*ñòðóêòóðà áóôåðà        */
    unsigned char BUF_ESD [80];                   /*áóôåð êàðòû ESD         */
} ESD;


union                                           /*îïðåäåëèòü îá'åäèíåíèå  */
{
    struct STR_BUF_TXT STR_TXT;                   /*ñòðóêòóðà áóôåðà        */
    unsigned char BUF_TXT [80];                   /*áóôåð êàðòû TXT         */
} TXT;

union                                           /*îïðåäåëèòü îá'åäèíåíèå  */
{
    struct STR_BUF_END STR_END;                   /*ñòðóêòóðà áóôåðà        */
    unsigned char BUF_END [80];                   /*áóôåð êàðòû ESD         */
} END;
#define maxMoreSym 8
void genMoreSymbols(char SYM[8])
{
    if(memcmp(SYM, "BUF", 3*sizeof(char))!=0)
    {
        return;
    }
    char newSym[8];
    memcpy(newSym, SYM, 8*sizeof(char));
    int last=0;
    for(last = 0;last<8;last++)
    {
        if(newSym[last] == ' ')
        {
            break;
        }
    }
    if(last > 6){return;}
    int dig=last+1;
    newSym[last]='+';
    for(int i=1;i<maxMoreSym;i++)
    {
        newSym[dig]='0'+i;
        ITSYM += 1;
        PRNMET = 'Y';                     /* устан.призн.налич.метки*/
        memcpy ( T_SYM[ITSYM].IMSYM,      /* запомнить имя символа  */
                newSym, 8 ); /* и                      */
        T_SYM[ITSYM].ZNSYM = CHADR;       /* его значение(отн.адр.) */
        T_SYM[ITSYM].DLSYM = 1;
    }
}

/*
 ******* Á Ë Î Ê  îá'ÿâëåíèé ïîäïðîãðàìì, èñïîëüçóåìûõ ïðè 1-îì ïðîñìîòðå
 */

int FDC()                                         /*ïîäïð.îáð.ïñ.îïåð.DC    */
{
    int len;
    
    switch (TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0])
    {
        case 'F' : len = 4;
            break;
            
        case 'H' : len = 2;
            break;
            
        case 'P' : if ( TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[1] == 'L' )
        {
            if (TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[2] == '3')
                len = 3;
            else
                len = 8;
        }
        else return (1);
            break;
            
        default  : return (1);
    }
    
    if ( PRNMET == 'Y' )                            /*åñëè ïñåâäîîï.DC ïîìå÷.,*/
    {                                              /*òî:                     */
        T_SYM[ITSYM].DLSYM = len;                    /*  óñò.äëèíó ñèìâ. =  4, */
        T_SYM[ITSYM].PRPER = 'R';                    /*  à,ïðèçí.ïåðåìåñò.='R' */
        T_SYM[ITSYM].ZNSYM = CHADR;                  /*   çàïîìí. â òàáë.ñèìâ. */
        //}
        PRNMET = 'N';                                /*  çàíóëèòü PRNMET çí.'N'*/
    }
    
    CHADR = CHADR + len;                            /*óâåëè÷.CHADR íà len è   */
    
    return (0);                                     /*óñïåøíî çàâåðøèòü ïîäïð.*/
}
/*..........................................................................*/
int FDS()                                         /*ïîäïð.îáð.ïñ.îïåð.DS    */
{
    if ( PRNMET == 'Y' )                            /*åñëè ïñåâäîîï.DC ïîìå÷.,*/
    {                                              /*òî:                     */
        if                                            /* åñëè ïñåâäîîïåðàöèÿ DC */
            (                                            /* îïðåäåëÿåò êîíñòàíòó   */
             TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0]=='F'/* òèïà F, òî âûïîëíèòü   */
             )                                            /* ñëåäóþùåå:             */
        {
            
            T_SYM[ITSYM].DLSYM = 4;                     /*  óñò.äëèíó ñèìâ. =  4, */
            T_SYM[ITSYM].PRPER = 'R';                   /*  à,ïðèçí.ïåðåìåñò.='R' */
            if (CHADR % 4)                           /*  è, åñëè CHADR íå óêàç.*/
            {                                          /*  íà ãðàíèöó ñëîâà, òî: */
                CHADR = (CHADR /4 + 1) * 4;                   /*   óñò.CHADR íà ãð.ñë. è*/
                T_SYM[ITSYM].ZNSYM = CHADR;                   /*   çàïîìí. â òàáë.ñèìâ. */
            }
            PRNMET = 'N';                               /*  çàíóëèòü PRNMET çí.'N'*/
            CHADR = CHADR + 4;                          /* óâåëè÷.CHADR íà 4      */
        }
        else
            return (1);                                  /* èíà÷å âûõîä ïî îøèáêå  */
    }
    else                                            /*åñëè æå ïñåâäîîï.íåïîìå÷*/
        if ( CHADR % 4 )                               /*è CHADR íå êðàòåí 4,òî: */
        {  CHADR = (CHADR /4 + 1) * 4;                   /* óñòàíîâ.CHADR íà ãð.ñë.*/
        }
    return (0);                                     /*óñïåøíî çàâåðøèòü ïîäïð.*/
}
/*..........................................................................*/
int FEND()                                        /*ïîäïð.îáð.ïñ.îïåð.END   */
{
    return (100);                                   /*âûõîä ñ ïðèçí.êîíöà 1-ãî*/
    /*ïðîñìîòðà               */
}
/*..........................................................................*/
int FEQU()                                        /*ïîäïð.îáð.ïñ.îïåð.EQU   */
{
    if                                              /*åñëè â îïåðàíäå         */
        (                                              /*ïñåâäîîïåðàöèè DC       */
         TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0] =='*' /*èñïîëüçîâàí ñèìâ. '*',  */
         )                                              /*òî                      */
    {                                             /* çàïîìíèòü â òàáë.ñèìâ.:*/
        T_SYM[ITSYM].ZNSYM = CHADR;                  /*  CHADR â ïîëå ZNSYM,   */
        T_SYM[ITSYM].DLSYM = 1;                      /*  1 â ïîëå DLSYM,       */
        T_SYM[ITSYM].PRPER = 'R';                    /*  'R' â ïîîëå PRPER     */
    }
    else                                            /*èíà÷å çàïîìí.â òàáë.ñèìâ*/
    {                                             /* çíà÷åíèå îï-íäà ïñ.îï. */
        T_SYM[ITSYM].ZNSYM = atoi (                  /* DC â ïîëå ZNSYM,       */
                                   (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND
                                   );
        T_SYM[ITSYM].DLSYM = 1;                      /* 1 â ïîëå DLSYM,        */
        T_SYM[ITSYM].PRPER = 'A';                    /* 'A' â ïîëå PRPER       */
        printf ("EQU - %s (%d)\n", T_SYM[ITSYM].IMSYM, T_SYM[ITSYM].ZNSYM);
    }
    PRNMET = 'N';                                   /*çàíóë.PRNMET çíà÷åí.'N' */
    return (0);                                     /*óñïåøíîå çàâåðø.ïîäïð.  */
}
/*..........................................................................*/
int FSTART()                                      /*ïîäïð.îáð.ïñ.îïåð.START */
{                                                /*CHADR óñòàíîâèòü ðàâíûì */
    CHADR =                                         /*çíà÷åíèþ îïåðàíäà       */
    atoi(
         (char*)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND/*ïñåâäîîïåðàöèè START è, */
         );
    if ( CHADR % 8 )                                /*åñëè ýòî çíà÷åíèå íå    */
    {                                              /*êðàòíî 8, òî ñäåëàòü åãî*/
        CHADR = ( CHADR + ( 8 - CHADR % 8 ) );        /*êðàòíûì                 */
    }                                              /*çàïîìíèòü â òàáë.ñèìâ.: */
    T_SYM[ITSYM].ZNSYM = CHADR;                     /* CHADR â ïîëå ZNSYM,    */
    T_SYM[ITSYM].DLSYM = 1;                         /* 1 â ïîëå DLSYM,        */
    T_SYM[ITSYM].PRPER = 'R';                       /* 'R' â ïîëå PRPER       */
    PRNMET = 'N';                                   /*çàíóë.PRNMET çíà÷åí.'N' */
    return (0);                                     /*óñïåøíîå çàâåðø.ïîäïðîãð*/
}
/*..........................................................................*/
int FUSING()                                      /*ïîäïð.îáð.ïñ.îïåð.USING */
{
    return (0);                                     /*óñïåøíîå çàâåðø.ïîäïðîãð*/
}
/*..........................................................................*/
int FRR()                                         /*ïîäïð.îáð.îïåð.RR-ôîðì. */
{
    CHADR = CHADR + 2;                              /*óâåëè÷èòü ñ÷.àäð. íà 2  */
    if ( PRNMET == 'Y' )                            /*åñëè ðàíåå îáíàð.ìåòêà, */
    {                                              /*òî â òàáë. ñèìâîëîâ:    */
        T_SYM[ITSYM].DLSYM = 2;                       /*çàïîìíèòü äëèíó ìàø.îïåð*/
        T_SYM[ITSYM].PRPER = 'R';                     /*è óñòàíîâèòü ïðèçí.ïåðåì*/
    }
    return(0);                                      /*âûéòè èç ïîäïðîãðàììû   */
}
/*..........................................................................*/
int FRX()                                         /*ïîäïð.îáð.îïåð.RX-ôîðì. */
{
    CHADR = CHADR + 4;                              /*óâåëè÷èòü ñ÷.àäð. íà 4  */
    if ( PRNMET == 'Y' )                            /*åñëè ðàíåå îáíàð.ìåòêà, */
    {                                              /*òî â òàáë. ñèìâîëîâ:    */
        T_SYM[ITSYM].DLSYM = 4;                       /*çàïîìíèòü äëèíó ìàø.îïåð*/
        T_SYM[ITSYM].PRPER = 'R';                     /*è óñòàíîâèòü ïðèçí.ïåðåì*/
    }
    return(0);                                      /*âûéòè èç ïîäïðîãðàììû   */
}
/*..........................................................................*/
int FSS()                                         /*ïîäïð.îáð.îïåð.SS-ôîðì. */
{
    CHADR = CHADR + 6;                              /*óâåëè÷èòü ñ÷.àäð. íà 6  */
    if ( PRNMET == 'Y' )                            /*åñëè ðàíåå îáíàð.ìåòêà, */
    {                                              /*òî â òàáë. ñèìâîëîâ:    */
        T_SYM[ITSYM].DLSYM = 6;                       /*çàïîìíèòü äëèíó ìàø.îïåð*/
        T_SYM[ITSYM].PRPER = 'R';                     /*è óñòàíîâèòü ïðèçí.ïåðåì*/
    }
    return(0);                                      /*âûéòè èç ïîäïðîãðàììû   */
}
/*..........................................................................*/

/*
 ******* Á Ë Î Ê  îá'ÿâëåíèé ïîäïðîãðàìì, èñïîëüçóåìûõ ïðè 2-îì ïðîñìîòðå
 */

void STXT( int ARG ,int flag )                              /*ïîäïð.ôîðìèð.TXT-êàðòû  */
{
    char *PTR;                                      /*ðàáî÷.ïåðåìåííàÿ-óêàçàò.*/
    if(flag == 1)
    {
        //	  printf("dddd");
        if (CHADR % 4) {
            CHADR = (CHADR /4 + 1) * 4;
        }
        return;
    }
    PTR = (char *)&CHADR;                           /*ôîðìèðîâàíèå ïîëÿ ADOP  */
    TXT.STR_TXT.ADOP[2]  = *PTR;                    /*TXT-êàðòû â ôîðìàòå     */
    TXT.STR_TXT.ADOP[1]  = *(PTR+1);                /*äâîè÷íîãî öåëîãî        */
    TXT.STR_TXT.ADOP[0]  = '\x00';                  /*â ñîãëàøåíèÿõ ÅÑ ÝÂÌ    */
    
    memset ( TXT.STR_TXT.OPER, 0x40, 56 );
    
    if ( ARG == 2 )                                 /*ôîðìèðîâàíèå ïîëÿ OPER  */
    {
        memcpy ( TXT.STR_TXT.OPER,RR.BUF_OP_RR , 2 ); /* äëÿ RR-ôîðìàòà         */
        TXT.STR_TXT.DLNOP [1] = 2;
    }
    else if ( ARG == 3 )
    {
        memcpy ( TXT.STR_TXT.OPER , PL3_buf , 3);   /* äëÿ PL3         */
        TXT.STR_TXT.DLNOP [1] = 3 ;
        
    }
    else if ( ARG == 4 )
    {
        memcpy ( TXT.STR_TXT.OPER , RX.BUF_OP_RX , 4);/* äëÿ RX-ôîðìàòà         */
        TXT.STR_TXT.DLNOP [1] = 4;
    }
    else if ( ARG == 6 )
    {
        memcpy ( TXT.STR_TXT.OPER , SS.BUF_OP_SS , 6);/* äëÿ RX-ôîðìàòà         */
        TXT.STR_TXT.DLNOP [1] = 6;
    }
    else
    { if ( ARG == 8 ){
        memcpy ( TXT.STR_TXT.OPER , PL8_buf , 8);     /* äëÿ PL8                */
        TXT.STR_TXT.DLNOP [1] = 8;}
    }
    
    memcpy (TXT.STR_TXT.POLE9,ESD.STR_ESD.POLE11,8);/*ôîðìèðîâ.èäåíòèôèê.ïîëÿ */
    memcpy ( OBJTEXT[ITCARD] , TXT.BUF_TXT , 80 );  /*çàïèñü îá'åêòíîé êàðòû  */
    ITCARD += 1;                                    /*êîððåêö.èíä-ñà ñâîá.ê-òû*/
    CHADR = CHADR + ARG;                            /*êîððåêö.ñ÷åò÷èêà àäðåñà */
    return;
}
/*..........................................................................*/
int SDC()                                         /*ïîäïð.îáð.ïñ.îïåð.DC    */
{
    char *RAB;                                      /*ðàáî÷àÿ ïåðåìåííàÿ      */
    
    if
        (                                             /* åñëè îïåðàíä íà÷èíàåòñÿ*/
         !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND,/* ñ êîìáèíàöèè           */
                 "F'", 2)                                /* F',                    */
         )                                             /* òî                     */
    {
        RAB=strtok                                    /*â ïåðåì. c óêàçàò.RAB   */
        (                                        /*âûáèðàåì ïåðâóþ ëåêñåìó */
         (char*)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND+2,/*îïåðàíäà òåêóùåé êàðòû  */
         "'"                                     /*èñõ.òåêñòà ÀÑÑÅÌÁËÅÐÀ   */
         );
        
        RX.RX = atol ( RAB );                         /*ïåðåâîä ASCII-> int     */
        RAB = (char *) &RX.RX;
        char temp[4];
        swab ( RAB , (char *)&temp[2] , 2 );
        swab ( (char *) &RAB[2] , temp , 2 );
        memcpy ( RAB, temp, 4);
        
        STXT (4,0);                                     /*ôîðìèðîâàíèå TXT-êàðòû  */
    }
    if
        (                                             /* åñëè îïåðàíä íà÷èíàåòñÿ*/
         !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND,/* ñ êîìáèíàöèè           */
                 "H'", 2)                            /* H',                    */
         )                                             /* òî                     */
    {
        RAB=strtok                                    /*â ïåðåì. c óêàçàò.RAB   */
        (                                        /*âûáèðàåì ïåðâóþ ëåêñåìó */
         (char*)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND+2,/*îïåðàíäà òåêóùåé êàðòû  */
         ".'"                                     /*èñõ.òåêñòà ÀÑÑÅÌÁËÅÐÀ   */
         );
        
        RR.RR = atoi ( RAB );                         /*ïåðåâîä ASCII-> int     */
        RAB = (char *) &RR.RR;                        /*ïðèâåäåíèå ê ñîãëàøåíèÿì*/
        swab ( RAB , RAB , 2 );                       /* ÅÑ ÝÂÌ                 */
        
        STXT (2,0);                                     /*ôîðìèðîâàíèå TXT-êàðòû  */
    }
    if
        (                                             /* åñëè îïåðàíä íà÷èíàåòñÿ*/
         !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND,/* ñ êîìáèíàöèè           */
                 "PL", 2)                                /* PL,                    */
         )                                             /* òî                     */
    {
        char znak = 0xF;
        int ind = 4;
        int len, i, ost;
        
        if (TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[2]=='3')
            len = 3;
        else
            len = 8;
        
        if (TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[4] == '+')
            znak = 0xC;
        else if (TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[4] == '-')
            znak = 0xD;
        
        i = 0;
        while ( TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[4+i] != '\'' )
        {
            i++;
            ind++;
        }
        
        char BUFF[8];
        memset (BUFF, 0, 8);
        BUFF[len-1] = znak;
        
        for (i=1; i<len*2;i++,ind--)
        {
            if ( TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[ind-1] == '\'' ||
                TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[ind-1] == '-' )
                break;
            
            ost = i % 2;
            
            char digit = TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[ind-1] - 48;
            
            if ( ost )
            {
                BUFF[len-1-(i-ost)/2] += digit << 4;
            }
            else
            {
                BUFF[len-1-i/2] = digit;
            }
        }
        
        printf ("current %d\n", CHADR);
        
        if (len == 4)
        {
            memcpy(RX.BUF_OP_RX, BUFF, 4);
            STXT (4,0);                                   /*ôîðìèðîâàíèå TXT-êàðòû  */
        }
        else if (len == 3)
        {
            memcpy(PL3_buf, BUFF, 3);
            print_pl_value (PL3_buf, 3);
            STXT (3,0);
        }
        else if (len == 8)
        {
            memcpy(PL8_buf, BUFF, 8);
            print_pl_value (PL8_buf, 8);
            STXT (8,0);
        }
    }
    
    return (0);                                     /*óñïåøí.çàâåðøåíèå ïîäïð.*/
}
/*..........................................................................*/
int SDS()                                         /*ïîäïð.îáð.ïñ.îïåð.DS    */
{
    RX.OP_RX.OP   = 0;                              /*çàíóëèì äâà ñòàðøèõ     */
    RX.OP_RX.R1X2 = 0;                              /*áàéòà RX.OP_RX          */
    if
        (                                             /* åñëè îïåðàíä íà÷èíàåòñÿ*/
         TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0]=='F' /* ñ êîìáèíàöèè F' èëè 0F */
         )                                             /* òî:                    */
    {
        RX.OP_RX.B2D2 = 0;                           /*çàíóëèì RX.OP_RX.B2D2   */
        STXT (4,0);                                    /*ôîðìèðîâàíèå TXT-êàðòû  */
        
    }
    else                                            /*èíà÷å                   */
        if
            (
             TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND[0]!='0'
             )
        {
            return (1);}                                  /*ñîîáùåíèå îá îøèáêå     */
    //printf("dfffd");
    
    STXT (0,1);                                    /*ôîðìèðîâàíèå TXT-êàðòû  */
    
    return (0);                                     /*óñïåøíî çàâåðøèòü ïîäïð.*/
}
/*..........................................................................*/
int SEND()                                        /*ïîäïð.îáð.ïñ.îïåð.END   */
{
    /*ôîðìèðîâàíèå            */
    memcpy (                                        /*èäåíòèôèêàöèîííãî ïîëÿ  */
            END.STR_END.POLE9 ,                     /* END - êàðòû            */
            ESD.STR_ESD.POLE11,                     /*                        */
            8                                       /*                        */
            );                                       /*                        */
    memcpy (                                        /*çàïèñü îá'åêòíîé êàðòû  */
            OBJTEXT[ITCARD],                        /* â                      */
            END.BUF_END,                            /* ìàññèâ                 */
            80                                      /* îá'åêòíûõ              */
            );                                       /* êàðò                   */
    ITCARD += 1;                                    /*êîððåêö.èíä-ñà ñâîá.ê-òû*/
    return (100);                                   /*âûõîä ñ ïðèçí.êîíöà 2-ãî*/
    /*ïðîñìîòðà               */
}
/*..........................................................................*/
int SEQU()                                        /*ïîäïð.îáð.ïñ.îïåð.EQU   */
{
    return (0);                                     /*óñïåøíîå çàâåðø.ïîäïð.  */
}
/*..........................................................................*/
int SSTART()                                      /*ïîäïð.îáð.ïñ.îïåð.START */
{
    char *PTR;                                      /*íàáîð                   */
    char *METKA;                                    /*ðàáî÷èõ                 */
    char *METKA1;                                   /*ïåðåìåííûõ              */
    int J;                                          /*ïîäïðîãðàììû            */
    int RAB;                                        /*                        */
    
    METKA1 = strtok                                 /*â ïåðåì. c óêàçàò.METKA1*/
	   (                                          /*âûáèðàåì ïåðâóþ ëåêñåìó */
        (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.METKA,   /*îïåðàíäà òåêóùåé êàðòû  */
        " "                                      /*èñõ.òåêñòà ÀÑÑÅÌÁËÅÐÀ   */
        );
    for ( J=0; J<=ITSYM; J++ )                      /* âñå ìåòêè èñõ.òåêñòà â */
    {                                              /* òàáë. T_SYM ñðàâíèâàåì */
						  /* ñî çíà÷.ïåðåì. *METKA1 */
        METKA = strtok (
                        (char*) T_SYM[J].IMSYM , " "
                        );
        if( !strcmp ( METKA , METKA1 ) )              /* è ïðè ñîâïàäåíèè:      */
        {                                            /*  áåðåì ðàçíîñòü ñ÷.àäð.*/
            RAB = CHADR - T_SYM[J].ZNSYM;               /*  çíà÷.ýòîé ìåòêè, îáðà-*/
            PTR = (char *)&RAB;                         /*  çóÿ äëèíó ïðîãðàììû â */
            swab ( PTR , PTR , 2 );                     /*  ñîãëàøåíèÿõ ÅÑ ÝÁÌ, è */
            ESD.STR_ESD.DLPRG [0] = 0;                  /*  çàïèñûâ.åå â ESD-êàðòó*/
            ESD.STR_ESD.DLPRG [1] = *PTR;               /*  ïîáàéòíî              */
            ESD.STR_ESD.DLPRG [2] = *(PTR + 1);         /*                        */
            CHADR = T_SYM[J].ZNSYM;                     /*óñòàíàâë.CHADR, ðàâíûì  */
            /*îïåðàíäó îïåðàò.START   */
            /*èñõîäíîãî òåêñòà        */
            PTR = (char *)&CHADR;                       /*ôîðìèðîâàíèå ïîëÿ ADPRG */
            ESD.STR_ESD.ADPRG[2]  = *PTR;               /*ESD-êàðòû â ôîðìàòå     */
            ESD.STR_ESD.ADPRG[1]  = *(PTR+1);           /*äâîè÷íîãî öåëîãî        */
            ESD.STR_ESD.ADPRG[0]  = '\x00';             /*â ñîãëàøåíèÿõ ÅÑ ÝÂÌ    */
            memcpy (                                    /*ôîðìèðîâàíèå            */
                    ESD.STR_ESD.IMPR ,                 /* èìåíè ïðîãðàììû        */
                    METKA ,                            /*  è                     */
                    strlen ( METKA )                   /*                        */
                    );                                   /*                        */
            memcpy (                                    /*èäåíòèôèêàöèîííãî ïîëÿ  */
                    ESD.STR_ESD.POLE11 ,               /* ESD - êàðòû            */
                    METKA ,                            /*                        */
                    strlen ( METKA )                   /*                        */
                    );                                   /*                        */
            memcpy (                                    /*çàïèñü îá'åêòíîé êàðòû  */
                    OBJTEXT[ITCARD] ,                  /* â                      */
                    ESD.BUF_ESD ,                      /* ìàññèâ                 */
                    80                                 /* îá'åêòíûõ              */
                    );                                   /* êàðò                   */
            ITCARD += 1;                                /*êîððåêö.èíä-ñà ñâîá.ê-òû*/
            return (0);                                 /*óñïåøíîå çàâåðø.ïîäïðîãð*/
        }
    }
    return (2);                                     /*îøèáî÷íîå çàâåðø.ïðîãð. */
}
/*..........................................................................*/
int SUSING()                                      /*ïîäïð.îáð.ïñ.îïåð.USING */
{
    /*íàáîð                   */
    char *METKA;                                    /*ðàáî÷èõ                 */
    char *METKA1;                                   /*ïåðåìåííûõ              */
    char *METKA2;                                   /*                        */
    int J;                                          /*                        */
    int NBASRG;                                     /*                        */
    METKA1 = strtok                                 /*â ïåðåì. c óêàçàò.METKA1*/
	   (                                      /*âûáèðàåì ïåðâóþ ëåêñåìó */
        (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /*îïåðàíäà òåêóùåé êàðòû  */
        ","                                   /*èñõ.òåêñòà ÀÑÑÅÌÁËÅÐÀ   */
        );
    METKA2 = strtok                                 /*â ïåðåì. c óêàçàò.METKA2*/
	   (                                      /*âûáèðàåì âòîðóþ ëåêñåìó */
        NULL,                                 /*îïåðàíäà òåêóùåé êàðòû  */
        " "                                   /*èñõ.òåêñòà ÀÑÑÅÌÁËÅÐÀ   */
        );
    if ( isalpha ( (int) *METKA2 ) )                /*åñëè ëåêñåìà íà÷èíàåòñÿ */
    {                                              /*ñ áóêâû, òî:            */
        
        for ( J=0; J<=ITSYM; J++ )                    /* âñå ìåòêè èñõ.òåêñòà â */
        {                                            /* òàáë. T_SYM ñðàâíèâàåì */
            /* ñî çíà÷.ïåðåì. *METKA2 */
            METKA = strtok (
                            (char*) T_SYM[J].IMSYM , " "
                            );
            if( !strcmp ( METKA , METKA2 ) )            /* è ïðè ñîâïàäåíèè:      */
            {                                          /*  çàïîìèíàåì çíà÷åíèå   */
                if ( (NBASRG = T_SYM[J].ZNSYM) <= 0x0f ) /*  ìåòêè â NBASRG è â ñë.*/
                    goto SUSING1;                           /*  NBASRG <= 0x0f èäåì íà*/
                /*  óñòàí.ðåãèñòðà áàçû   */
                else                                     /* èíà÷å:                 */
                    return (6);                             /*  ñîîáùåíèå îá îøèáêå   */
                
            }
        }
        return (2);                                   /*çàâåðø.ïîäïð.ïî îøèáêå  */
    }
    else                                            /*èíà÷å, åñëè âòîðîé îïåð.*/
    {                                              /*íà÷èíàåòñÿ ñ öèôðû, òî: */
        NBASRG = atoi ( METKA2 );                     /* çàïîìíèì åãî â NBASRG  */
        if ( (NBASRG = T_SYM[J].ZNSYM) <= 0x0f )      /* è,åñëè îí <= 0x0f,òî:  */
            goto SUSING1;                                /* èäåì íà óñòàí.ðåã.áàçû */
        else                                          /*èíà÷å:                  */
            return (6);                                  /* ñîîáùåíèå îá îøèáêå    */
    }
    
SUSING1:                                         /*óñòàíîâèòü áàçîâûé ðåã. */
    
    T_BASR [NBASRG - 1].PRDOST = 'Y';               /* âçâåñòè ïðèçí.àêòèâí.  */
    if ( *METKA1 == '*' )                           /* åñëè ïåðâ.îï-íä == '*',*/
    {
        T_BASR[NBASRG-1].SMESH = CHADR;               /* âûáèð.çíà÷.áàçû ==CHADR*/
    }
    else                                            /*èíà÷å:                  */
    {
        for ( J=0; J<=ITSYM; J++ )                    /* âñå ìåòêè èñõ.òåêñòà â */
        {                                            /* òàáë. T_SYM ñðàâíèâàåì */
            /* ñî çíà÷.ïåðåì. *METKA1 */
            METKA = strtok (
                            (char*) T_SYM[J].IMSYM , " "
                            );
            if( !strcmp ( METKA , METKA1 ) )            /* è ïðè ñîâïàäåíèè:      */
            {                                          /*  áåðåì çíà÷åíèå ýòîé   */
                T_BASR[NBASRG-1].SMESH = T_SYM[J].ZNSYM;  /*  ýòîé ìåòêè êàê áàçó   */
            }
        }
        return (2);                                   /*çàâåðøåíèå ïðîãð.ïî îøèá*/
    }
    return (0);                                     /*óñïåøíîå çàâåðø.ïîäïðîãð*/
}
/*..........................................................................*/
int SRR()                                         /*ïîäïð.îáð.îïåð.RR-ôîðì. */
{
    char *METKA;                                    /*íàáîð                   */
    char *METKA1;                                   /*ðàáî÷èõ                 */
    char *METKA2;                                   /*ïåðåìåííûõ              */
    unsigned char R1R2;                             /*                        */
    int J;                                          /*                        */
    RR.OP_RR.OP = T_MOP[I3].CODOP;                  /*ôîðìèðîâàíèå êîäà îïåðàö*/
    
    METKA1 = strtok                                 /*â ïåðåì. c óêàçàò.METKA1*/
	   (                                      /*âûáèðàåì ïåðâóþ ëåêñåìó */
        (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /*îïåðàíäà òåêóùåé êàðòû  */
        ","                                   /*èñõ.òåêñòà ÀÑÑÅÌÁËÅÐÀ   */
        );
    
    METKA2 = strtok                                 /*â ïåðåì. c óêàçàò.METKA2*/
	   (                                      /*âûáèðàåì âòîðóþ ëåêñåìó */
        NULL,                                 /*îïåðàíäà òåêóùåé êàðòû  */
        " "                                   /*èñõ.òåêñòà ÀÑÑÅÌÁËÅÐÀ   */
        );
    
    if ( isalpha ( (int) *METKA1 ) )                /*åñëè ëåêñåìà íà÷èíàåòñÿ */
    {                                              /*ñ áóêâû, òî:            */
        for ( J=0; J<=ITSYM; J++ )                    /* âñå ìåòêè èñõ.òåêñòà â */
        {                                            /* òàáë. T_SYM ñðàâíèâàåì */
            /* ñî çíà÷.ïåðåì. *METKA1 */
            METKA = strtok (
                            (char*) T_SYM[J].IMSYM , " "
                            );
            if( !strcmp ( METKA , METKA1 ) )            /* è ïðè ñîâïàäåíèè:      */
            {                                          /*  áåðåì çíà÷åíèå ýòîé   */
                R1R2 = T_SYM[J].ZNSYM << 4;              /*  ìåòêè â êà÷åñòâå ïåðâ.*/
                goto SRR1;
            }                                          /*  îïðåðàíäà ìàøèííîé êîì*/
        }
        return(2);                                    /*ñîîáù."íåîá'ÿâë.èäåíòèô"*/
    }
    else                                            /*èíà÷å, áåðåì â êà÷åñòâå */
    {                                              /*ïåðâ.îïåðàíäà ìàøèíí.êîì*/
        R1R2 = atoi ( METKA1 ) << 4;                 /*çíà÷åí.âûáð.   ëåêñåìû  */
    }
    
    
SRR1:
    
    
    if ( isalpha ( (int) *METKA2 ) )                /*åñëè ëåêñåìà íà÷èíàåòñÿ */
    {                                              /*ñ áóêâû, òî:            */
        for ( J=0; J<=ITSYM; J++ )                    /* âñå ìåòêè èñõ.òåêñòà â */
        {                                            /* òàáë. T_SYM ñðàâíèâàåì */
            /* ñî çíà÷.ïåðåì. *ÌÅÒÊÀ2 */
            METKA = strtok (
                            (char*) T_SYM[J].IMSYM , " "
                            );
            if( !strcmp ( METKA , METKA2 ) )            /* è ïðè ñîâïàäåíèè:      */
            {                                          /*  áåðåì çíà÷åíèå ýòîé   */
                R1R2 = R1R2 + T_SYM[J].ZNSYM;            /*  ìåòêè â êà÷åñòâå âòîð.*/
                goto SRR2;                               /*                        */
            }                                          /*  îïðåðàíäà ìàøèííîé êîì*/
        }                                            /*                        */
        return(2);                                    /*ñîîáù."íåîá'ÿâë.èäåíòèô"*/
    }
    else                                            /*èíà÷å, áåðåì â êà÷åñòâå */
    {                                              /*âòîð.îïåðàíäà ìàøèíí.êîì*/
        R1R2 = R1R2 + atoi ( METKA2 );               /*çíà÷åí.âûáð.   ëåêñåìû  */
    }
    
SRR2:
    
    RR.OP_RR.R1R2 = R1R2;                           /*ôîðìèðóåì îïåð-äû ìàø-îé*/
    /*êîìàíäû                 */
    
    STXT(2,0);
    return(0);                                      /*âûéòè èç ïîäïðîãðàììû   */
}

/*..........................................................................*/
int SRX()                                         /*ïîäïð.îáð.îïåð.RX-ôîðì. */
{
    char *METKA;                                    /*íàáîð                   */
    char *METKA1;                                   /*ðàáî÷èõ                 */
    char *METKA2;                                   /*ïåðåìåííûõ              */
    char *PTR;                                      /*                        */
    int  DELTA;                                     /*                        */
    int  ZNSYM;                                     /*                        */
    int  NBASRG;                                    /*                        */
    int J;                                          /*                        */
    int I;                                          /*                        */
    unsigned char R1X2;                             /*                        */
    int B2D2;                                       /*                        */
    RX.OP_RX.OP = T_MOP[I3].CODOP;                  /*ôîðìèðîâàíèå êîäà îïåðàö*/
    METKA1 = strtok                                 /*â ïåðåì. c óêàçàò.METKA1*/
	   (                                      /*âûáèðàåì ïåðâóþ ëåêñåìó */
        (char*) TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, /*îïåðàíäà òåêóùåé êàðòû  */
        ","                                   /*èñõ.òåêñòà ÀÑÑÅÌÁËÅÐÀ   */
        );
    
    METKA2 = strtok                                 /*â ïåðåì. c óêàçàò.METKA2*/
	   (                                      /*âûáèðàåì âòîðóþ ëåêñåìó */
        NULL,                                 /*îïåðàíäà òåêóùåé êàðòû  */
        " "                                   /*èñõ.òåêñòà ÀÑÑÅÌÁËÅÐÀ   */
        );
    
    if ( !isdigit ( (int) *METKA1 ) )                /*åñëè ëåêñåìà íà÷èíàåòñÿ */
    {                                              /*ñ áóêâû, òî:            */
        for ( J=0; J<=ITSYM; J++ )                    /* âñå ìåòêè èñõ.òåêñòà â */
        {                                            /* òàáë. T_SYM ñðàâíèâàåì */
            /* ñî çíà÷.ïåðåì. *METKA  */
            METKA = strtok (
                            (char*) T_SYM[J].IMSYM , " "
                            );
            if( !strcmp ( METKA , METKA1 ) )            /* è ïðè ñîâïàäåíèè:      */
                
            {                                          /*  áåðåì çíà÷åíèå ýòîé   */
                R1X2 = T_SYM[J].ZNSYM << 4;              /*  ìåòêè â êà÷åñòâå ïåðâ.*/
                goto SRX1;
            }                                          /*  îïðåðàíäà ìàøèííîé êîì*/
        }
        return(2);                                    /*ñîîáù."íåîá'ÿâë.èäåíòèô"*/
    }
    else                                            /*èíà÷å, áåðåì â êà÷åñòâå */
    {                                              /*ïåðâ.îïåðàíäà ìàøèíí.êîì*/
        R1X2 = atoi ( METKA1 ) << 4;                 /*çíà÷åí.âûáð.   ëåêñåìû  */
    }
    
    
SRX1:
    
    
    if ( !isdigit ( (int) *METKA2 ) )                /*åñëè ëåêñåìà íà÷èíàåòñÿ */
    {                                              /*ñ áóêâû, òî:            */
        for ( J=0; J<=ITSYM; J++ )                    /* âñå ìåòêè èñõ.òåêñòà â */
        {                                            /* òàáë. T_SYM ñðàâíèâàåì */
            /* ñî çíà÷.ïåðåì. *ÌÅÒÊÀ  */
            METKA = strtok (
                            (char*) T_SYM[J].IMSYM , " "
                            );
            if( !strcmp ( METKA , METKA2 ) )            /* è ïðè ñîâïàäåíèè:      */
            {                                          /*  óñòàíîâèòü íà÷.çíà÷.: */
                NBASRG = 0;                               /*   íîìåðà áàçîâ.ðåãèñòðà*/
                DELTA  = 0xfff - 1;                       /*   è åãî çíà÷åí.,à òàêæå*/
                ZNSYM  = T_SYM[J].ZNSYM;                  /*   ñìåùåí.âòîð.îïåðàíäà */
                for ( I=0; I<15; I++ )                    /*äàëåå â öèêëå èç âñåõ   */
                {                                        /*ðåã-ðîâ âûáåðåì áàçîâûì */
                    if (                                    /*òîò, êîòîðûé èìååò:     */
                        T_BASR[I].PRDOST == 'Y'            /* ïðèçí.àêòèâíîñòè,      */
                        &&                                  /*  è                     */
                        ZNSYM - T_BASR[I].SMESH >= 0       /* çíà÷åíåíèå, ìåíüøåå ïî */
                        &&                                  /* âåëè÷èíå,íî íàèáîëåå   */
                        ZNSYM - T_BASR[I].SMESH < DELTA    /* áëèçêîå ê ñìåùåíèþ âòî-*/
                        )                                    /* ðîãî îïåðàíäà          */
                    {
                        NBASRG = I + 1;
                        DELTA  = ZNSYM - T_BASR[I].SMESH;
                    }
                }
                if ( NBASRG == 0 || DELTA > 0xfff )       /*åñëè áàç.ðåã.íå âûáð.,òî*/
                    return(5);                               /* çàâåðø.ïîäïð.ïî îøèáêå */
                else                                      /*èíà÷å                   */
                {                                        /* ñôîðìèðîâûàòü ìàøèííîå */
                    B2D2 = NBASRG << 12;                    /* ïðåäñòàâëåíèå âòîðîãî  */
                    B2D2 = B2D2 + DELTA;                    /* îïåðàíäà â âèäå B2D2   */
                    PTR = (char *)&B2D2;                    /* è â ñîãëàøåíèÿõ ÅÑ ÝÂÌ */
                    swab ( PTR , PTR , 2 );                 /* ñ çàïèñüþ â òåëî êîì-äû*/
                    RX.OP_RX.B2D2 = B2D2;
                }
                goto SRX2;                                /*ïåðåõ.íà ôîðì.ïåðâîãî   */
            }                                      /*  îïðåðàíäà ìàøèííîé êîì*/
        }
        return(2);                                    /*ñîîáù."íåîá'ÿâë.èäåíòèô"*/
    }
    else                                            /*èíà÷å, áåðåì â êà÷åñòâå */
    {                                              /*âòîð.îïåðàíäà ìàøèíí.êîì*/
        return(4);                                    /*çíà÷åí.âûáð.   ëåêñåìû  */
    }
    
SRX2:
    
    RX.OP_RX.R1X2 = R1X2;                           /*äîçàïèñü ïåðâ.îïåðàíäà  */
    
    STXT(4,0);                                        /*ôîðìèðîâàíèå TXT-êàðòû  */
    return(0);                                      /*âûéòè èç ïîäïðîãðàììû   */
}

/* return index in identifier's table or -1 if value doesn't exist */

int get_symbol_index (const char* METKA) 
{
    for (int i = 0; i<=ITSYM; i++ ) 
    {                        
        if(!strncmp ( METKA , (char*) T_SYM[i].IMSYM, 8 )) 
        {
            return i;
        }
    }
    
    return -1;
}

/* return absolute addr from relative or -1 on error */

int get_full_addr (int relative_addr)
{
    int NBASRG = 0;        
    int DELTA  = 0xFFF - 1;
    
    for (int I=0; I<15; I++)  
    {                       
        if (            
            T_BASR[I].PRDOST == 'Y'                 &&                      
            relative_addr - T_BASR[I].SMESH >= 0    &&                          
            relative_addr - T_BASR[I].SMESH < DELTA
            )                              
        {
            NBASRG = I + 1;
            DELTA  = relative_addr - T_BASR[I].SMESH;
        }
    }
    
    if ( NBASRG == 0 || DELTA > 0xFFF ) 
    {
        return -1;                          
    }
    else                                
    {                                   
        return (NBASRG << 12) + DELTA;                                
    }
}

/*..........................................................................*/
int SSS()                                         /*ïîäïð.îáð.îïåð.SS-ôîðì. */
{
    SS.OP_SS.OP = T_MOP[I3].CODOP;
    
    printf ("%s\n", (char*)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND);
    char op1[8], op2[8];
    int offset, length, B1D1, B2D2;
    
    if (4 == sscanf ((char*)TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAND, "%8[^+]+%d(%d),%8s", op1, &offset, &length, op2)) {
        printf ("%s %s %d %d\n", op1, op2, offset, length);
        
        int ide1, ide2;
        if ((ide1 = get_symbol_index(op1)) < 0 || (ide2 = get_symbol_index(op2)) < 0) {
            return 2;
        }
        
        B1D1 = get_full_addr(T_SYM[ide1].ZNSYM) + offset;
        if (-1 == B1D1) { printf ("bad addr of first operand\n"); return 2; }
        swab ( &B1D1 , &B1D1 , 2 );              
        
        B2D2 = get_full_addr(T_SYM[ide2].ZNSYM);                 
        if (-1 == B2D2) { printf ("bad addr of second operand\n"); return 2; }
        swab ( &B2D2 , &B2D2 , 2 );
        
        SS.OP_SS.L1L2 = length - 1;
        SS.OP_SS.B1D1 = B1D1;
        SS.OP_SS.B2D2 = B2D2;
        
        printf ("%d(%0X) %d(%0X)\n", ide1, B1D1, ide2, B2D2);
    }
    else
    {
        printf ("bad command format");
        return 2; // another error code?
    }
    
    STXT(6,0); 
    return 0;
}
/*..........................................................................*/
int SOBJFILE()                                    /*подпрогр.формир.об'екн. */
{                                                 /*файла                   */
	FILE *fp;                                 /*набор рабочих           */
	int RAB2;                                 /*переменных              */
	/*формирование пути и име-*/
	strcat ( NFIL, "tex" );                   /*ни об'ектного файла     */
	if ( (fp = fopen ( NFIL, "wb" )) == NULL ) /*при неудачн.открыт.ф-ла */
		return (-7);                      /* сообщение об ошибке    */
	else                                      /*иначе:                  */
		RAB2 =fwrite (OBJTEXT, 80, ITCARD, fp); /* формируем тело об.файла*/
	fclose ( fp );                            /*закрываем об'ектный файл*/
	return ( RAB2 );                          /*завершаем  подпрограмму */

}
/*..........................................................................*/
void INITUNION ()
{

/*
 ***** и н и ц и а л и з а ц и я   полей буфера формирования записей ESD-типа
 *****                             для выходного объектного файла
 */

	ESD.STR_ESD.POLE1      =  0x02;
	memcpy ( ESD.STR_ESD.POLE2, "ESD", 3 );
	memset ( ESD.STR_ESD.POLE3,  0x40, 6 );
	ESD.STR_ESD.POLE31 [0] = 0x00;
	ESD.STR_ESD.POLE31 [1] = 0x10;
	memset ( ESD.STR_ESD.POLE32, 0x40, 2 );
	ESD.STR_ESD.POLE4  [0] = 0x00;
	ESD.STR_ESD.POLE4  [1] = 0x01;
	memset ( ESD.STR_ESD.IMPR,   0x40, 8 );
	ESD.STR_ESD.POLE6      = 0x00;
	memset ( ESD.STR_ESD.ADPRG,  0x00, 3 );
	ESD.STR_ESD.POLE8      = 0x40;
	memset ( ESD.STR_ESD.DLPRG,  0x00, 3 );
	memset ( ESD.STR_ESD.POLE10, 0x40,40 );
	memset ( ESD.STR_ESD.POLE11, 0x40, 8 );

/*
 ***** и н и ц и а л и з а ц и я   полей буфера формирования записей TXT-типа
 *****                             для выходного объектного файла
 */

	TXT.STR_TXT.POLE1      =  0x02;
	memcpy ( TXT.STR_TXT.POLE2, "TXT", 3 );
	TXT.STR_TXT.POLE3      =  0x40;
	memset ( TXT.STR_TXT.ADOP,   0x00, 3 );
	memset ( TXT.STR_TXT.POLE5,  0x40, 2 );
	memset ( TXT.STR_TXT.DLNOP,  0X00, 2 );
	memset ( TXT.STR_TXT.POLE7,  0x40, 2 );
	TXT.STR_TXT.POLE71 [0] = 0x00;
	TXT.STR_TXT.POLE71 [1] = 0x01;
	memset ( TXT.STR_TXT.OPER,   0x40,56 );
	memset ( TXT.STR_TXT.POLE9,  0x40, 8 );

/*
 ***** и н и ц и а л и з а ц и я   полей буфера формирования записей END-типа
 *****                             для выходного объектного файла
 */

	END.STR_END.POLE1      =  0x02;
	memcpy ( END.STR_END.POLE2, "END", 3 );
	memset ( END.STR_END.POLE3,  0x40,68 );
	memset ( END.STR_END.POLE9,  0x40, 8 );

}

/*..........................................................................*/

int main( int argc, char **argv )                /*главная программа       */
{
	FILE *fp;
	char *ptr = argv [1];
	unsigned char ASSTEXT [DL_ASSTEXT][80];

/*
 ******* Б Л О К  об'явлений рабочих переменных
 */

	int I1, I2, RAB;                          /* переменные цикла      */

	INITUNION ();                             /* начальное заполнение  */
	/* буферов формирования  */
	/* записей выходного объ-*/
	/* ектного  файла        */

/*
 ******       Н А Ч А Л О   П Е Р В О Г О  П Р О С М О Т Р А      *****
 */
/*
 ***** Б Л О К  инициализации массива ASSTEXT, заменяющий иниц-ю в об'явлении
 *****          (введен как реакция на требования BORLANDC++ 2.0)
 */

	strcpy ( NFIL, ptr );

	if ( argc != 2 )

	{
		printf ( "%s\n", "Ошибка в командной строке" );
		return 1;
	}


	if ( strcmp ( &NFIL [ strlen ( NFIL )-3 ], "ass" ) )

	{
		printf ( "%s\n", "Неверный тип файла с исходным текстом" );
		return 1;
	}


	else

	{
		if ( (fp = fopen ( NFIL, "rb" )) == NULL ) /*при неудачн.открыт.ф-ла */
		/* сообщение об ошибке    */
		{
			printf ( "%s\n", "Не найден файл с исходным текстом" );
			return 1;
		}

		else

		{
			for ( I1 = 0; I1 <= DL_ASSTEXT; I1++ )

			{
                if ( fgets(ASSTEXT [I1], 80, fp) == NULL )
				//if ( !fread ( ASSTEXT [I1], 80, 1, fp ) )
				{
					if ( feof ( fp ) )
						goto main1;
					else
					{
						printf ( "%s\n", "Ошибка при чтении фыйла с исх.текстом" );
						return 1;
					}
				}
                for (int i=0; i<strlen(ASSTEXT [I1]); i++)
                {
                    if(ASSTEXT [I1][i]=='\n')
                        ASSTEXT [I1][i]=0;
                }
                //printf("%s\n",ASSTEXT [I1]);
			}

			printf ( "%s\n", "Переполнение буфера чтения исх.текста" );
			return 1;
		}

	}

main1:

	fclose ( fp );
	NFIL [ strlen ( NFIL )-3 ] = '\x0';

/*
 ***** К О Н Е Ц блока инициализации
 */

	for ( I1=0; I1 < DL_ASSTEXT; I1++ )       /*для карт с 1 по конечную*/
	{                                         /*                        */
		memcpy ( TEK_ISX_KARTA.BUFCARD, ASSTEXT[I1], /*ч-ть очередн.карту в буф*/
		         80 );/*                        */
		if (TEK_ISX_KARTA.STRUCT_BUFCARD.METKA [0] == /*переход при отсутствии  */
		    ' ') /*метки                   */
			goto CONT1;               /*на CONT1,               */
		/*иначе:                  */
		ITSYM += 1;                       /* переход к след.стр.TSYM*/
		PRNMET = 'Y';                     /* устан.призн.налич.метки*/
		memcpy ( T_SYM[ITSYM].IMSYM,      /* запомнить имя символа  */
		         TEK_ISX_KARTA.STRUCT_BUFCARD.METKA, 8 ); /* и                      */
		T_SYM[ITSYM].ZNSYM = CHADR;       /* его значение(отн.адр.) */
        genMoreSymbols(TEK_ISX_KARTA.STRUCT_BUFCARD.METKA);

/*
 ***** Б Л О К  поиска текущей операции среди псевдоопераций
 */

CONT1:
        printf("%s\n",TEK_ISX_KARTA.BUFCARD);
		for ( I2=0; I2 < NPOP; I2++ )     /*для всех стр.таб.пс.опер*/
		{                                 /*выполнить следущее:     */
			if(                       /* если                   */
			        !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* псевдооперация         */
			                T_POP[I2].MNCPOP, 5) /* распознана,            */
			        )           /* то:                    */
			/*                        */
			{ switch ( T_POP[I2].BXPROG () ) /* уйти в подпр.обработки */
			  {
			  case 0:
				  goto CONT2; /* и завершить цикл       */
			  case 1:
				  goto ERR1;
			  case 100:
				  goto CONT3;
			  }   }                   /*                        */
		}                                 /*                        */

		for ( I3=0; I3 < NOP; I3++ )      /*для всех стр.таб.м.опер.*/
		{                                 /*выполнить следующее:    */
			if(                       /* если                   */
			        !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* машинная операция      */
			                T_MOP[I3].MNCOP, 5) /* распознана,            */
			        )           /* то:                    */
			{
				T_MOP[I3].BXPROG (); /* уйти в подпр.обработки */
				PRNMET = 'N'; /* снять призн.налич.метки*/
				goto CONT2; /* и завершить цикл       */
			}
		}
		goto ERR3;                        /*сообщ.'мнемокод нерасп.'*/

CONT2:
		continue;                         /*конец цикла обработки   */
	}                                         /*карт исх.текста         */

/*
 ******       Н А Ч А Л О   В Т О Р О Г О  П Р О С М О Т Р А      *****
 */

CONT3:
        printf("\n\n\n\n");

	T_MOP[0].BXPROG = SRR; // BALR            /*установить указатели    */
	T_MOP[1].BXPROG = SRR; // BCR             /*на подпрограммы обраб-ки*/
	T_MOP[2].BXPROG = SRX; // ST              /*команд АССЕМБЛЕРА при   */
	T_MOP[3].BXPROG = SRX; // L               /*втором просмотре        */
	T_MOP[4].BXPROG = SRX; // A
	T_MOP[5].BXPROG = SRX; // S
    
    T_MOP[6].BXPROG = SSS; // MVC
    T_MOP[7].BXPROG = SRX; // CVB
    T_MOP[8].BXPROG = SRR; // CR
    T_MOP[9].BXPROG = SRX; // BC
    T_MOP[10].BXPROG = SRX; // LH

    
	T_POP[0].BXPROG = SDC;                    /*установить указатели    */
	T_POP[1].BXPROG = SDS;                    /*на подпрограммы обраб-ки*/
	T_POP[2].BXPROG = SEND;                   /*псевдокоманд АССЕМБЛЕРА */
	T_POP[3].BXPROG = SEQU;                   /*при втором просмотре    */
	T_POP[4].BXPROG = SSTART;
	T_POP[5].BXPROG = SUSING;

	for ( I1=0; I1 < DL_ASSTEXT; I1++ )       /*для карт с 1 по конечную*/
	{           /*                        */
		memcpy ( TEK_ISX_KARTA.BUFCARD, ASSTEXT [I1],/*ч-ть очередн.карту в буф*/
		         80 );/*                        */
/*
 ***** Б Л О К  поиска текущей операции среди псевдоопераций
 */

		for ( I2=0; I2 < NPOP; I2++ )     /*для всех стр.таб.пс.опер*/
		{                                 /*выполнить следущее:     */
			if(                       /* если                   */
			        !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* псевдооперация         */
			                T_POP[I2].MNCPOP, 5) /* распознана,            */
			        )           /* то                     */
			/*                        */
			{ switch ( T_POP[I2].BXPROG () ) /* уйти в подпр.обработки */
			  {
			  case 0:
				  goto CONT4; /* и завершить цикл       */
			  case 100:         /*уйти на формирование    */
				  goto CONT5; /*об'ектного файла        */
			  }   }                   /*                        */
		}                                 /*                        */

		for ( I3=0; I3 < NOP; I3++ )      /*для всех стр.таб.м.опер.*/
		{                                 /*выполнить следующее:    */
			if(                       /* если                   */
			        !memcmp(TEK_ISX_KARTA.STRUCT_BUFCARD.OPERAC,/* машинная операция      */
			                T_MOP[I3].MNCOP, 5) /* распознана             */
			        )           /* то                     */
			/*                        */
			{
				switch ( T_MOP[I3].BXPROG () ) /* уйти в подпр.обработки */
				{
				case 0:
					goto CONT4; /* и завершить цикл       */

				case 2:     /*выдать диагностическое  */
					goto ERR2; /*сообщение               */

				case 4:     /*выдать диагностическое  */
					goto ERR4; /*сообщение               */

				case 5:     /*выдать диагностическое  */
					goto ERR5; /*сообщение               */

				case 6:     /*выдать диагностическое  */
					goto ERR6; /*сообщение               */

				case 7:     /*выдать диагностическое  */
					goto ERR6; /*сообщение               */

				}
			}

		}

CONT4:
		continue;                         /*конец цикла обработки   */
	}                                         /*карт исх.текста         */

CONT5:

	if ( ITCARD == (RAB = SOBJFILE ()) )      /*если в об'ектный файл   */
		/*выведены все карты, то: */
		printf                            /* сообшение об успешном  */
		        (                         /* завершении             */
		        "%s\n",
		        "успешое завершение трансляции"
		        );
	else                                      /*иначе:                  */
	{
		if ( RAB == -7 )
			goto ERR7;
		else
			printf                    /* сообшение о неудачном  */
			        (                 /* фрмировании об'ектного */
			        "%s\n",           /* файла                  */
			        "ошибка при формировании об'ектного файла"
			        );
	}
	return 1;                                   /*завершить main-прогр.   */

ERR1:
	printf ("%s\n","ошибка формата данных");  /*выдать диагностич.сообщ.*/
	goto CONT6;

ERR2:
	printf ("%s\n","необ'явленный идентификатор"); /*выдать диагностич.сообщ.*/
	goto CONT6;

ERR3:
	printf ("%s\n","ошибка кода операции");   /*выдать диагностич.сообщ.*/
	goto CONT6;

ERR4:
	printf ("%s\n","ошибка второго операнда"); /*выдать диагностич.сообщ.*/
	goto CONT6;

ERR5:
	printf ("%s\n","ошибка базирования");     /*выдать диагностич.сообщ.*/
	goto CONT6;

ERR6:
	printf ("%s\n","недопустимый номер регистра"); /*выдать диагностич.сообщ.*/
	goto CONT6;

ERR7:
	printf ("%s\n","ошибка открытия об'ектн.файла");/*выдать диагностич.сообщ.*/
	goto CONT6;


CONT6:
	printf ("%s%d\n","ошибка в карте N ",I1+1); /*выдать диагностич.сообщ.*/
    printf("%s\n",TEK_ISX_KARTA.BUFCARD);
	return 0;
}                                                 /*конец main-программы    */
/* return index in identifier's table or -1 if value doesn't exist */
